{"intents": [
  {
    "tag": "positive",
    "patterns": [
      "I got accepted into two colleges. Should I follow what my heart says versus where my friends are going too?",
      "Can I bring my grades up?",
      "Will be able to pass the exam this semester?",
      "Will I be able to get a higher education?",
      "Will I be able to improve my concentrate and study for the Social Science final?",
      "Is today the right day to tell my parents I failed in my last Math Exam?",
      "Will I get admission into my choice of college this year?",
      "Will college boost my career?",
      "Can I become famous in college?",
      "Should I opt to become a part of the cheerleading team?",
      "Should I opt to become a part of the football team?",
      "Should I get an internship this summer?",
      "Will I get the scholarship this year?",
      "Will I be able to get better grades than my compeititor, (insert name of competitor), this year?",
      "Should I go abroad for my high school?",
      "Should I apply to other countries too for my undergraduate studies?",
      "I feel inventive and lucky this year. Should I quite my workplace and look for a more fulfilling job?",
      "Is next year a good time to retire?",
      "Should I relocate for the new job offer?",
      "Should I accept the new job offer?",
      "Should I start looking for new work options now?",
      "Should I go out for lunch break today?",
      "A music label is offering me a contract. Should I accept it?",
      "I was asked by a friend to become his business partner. Is it a good idea?",
      "Should I launch a new business this year?",
      "Can I trust my new business partner?",
      "Should I hire the new candidate I interviewed today?",
      "Will we make the sales deal today?",
      "Will me new handmade products business be successful?",
      "Am I in love with my girlfriend?",
      "Will we ever get a dog? OR Should we get a dog?",
      "Is it time to relocate?",
      "Should I re-decorate my house this week?",
      "Should I live in my current country or think of relocating?",
      "Will the party I’m hosting this weekend go well?",
      "Should I get a new haircut?",
      "I have my tattoo designed and ready. Should I go get it done this weekend?",
      "I have been interested in becoming vegan for a long time. Is this the right time to switch?",
      "Does deforestation contribute to climate change?",
      "Are greenhouse gases causing global warming?",
      "Do rising sea levels pose risks?",
      "Are polar ice caps melting due to climate change?",
      "Is renewable energy crucial for combating climate change?",
      "Does climate change affect weather patterns?",
      "Does ocean acidification have harmful consequences?",
      "Do human activities contribute to global warming?",
      "Is the goal of the Paris Agreement to combat climate change?",
      "Do extreme weather events result from climate change?",
      "Is biodiversity loss linked to climate change?",
      "Do fossil fuels contribute to global warming?",
      "Are there implications of permafrost thawing?",
      "Are countries taking action to address climate change?",
      "Does the carbon cycle impact climate?",
      "Are there effects of ocean temperature rise?",
      "Is there a connection between climate change and droughts?",
      "Does melting of glaciers affect ecosystems?",
      "Are there risks of climate-induced migration?",
      "Does climate change impact agriculture?",
      "Does ocean circulation influence climate?",
      "Are there prospects for renewable energy growth?",
      "Is there a link between climate change and hurricanes?",
      "Do changing precipitation patterns affect us?",
      "Does deforestation play a role in climate change?",
      "Are there consequences of coral reef bleaching?",
      "Does climate change affect coastal communities?",
      "Are there effects of climate change on forests?",
      "Are measures taken to address deforestation?",
      "Does climate change affect the economy?",
      "Are there long-term projections for climate change?",
      "Does the melting Arctic ice have an impact?",
      "Does climate change affect freshwater resources?",
      "Are there social justice implications of climate change?",
      "Is there a connection between climate change and wildfires?",
      "Do melting ice caps impact sea levels?",
      "Are there consequences of climate-induced species extinction?",
      "Does climate change influence ocean health?",
      "Is there a role for international climate agreements?",
      "Are ecosystems adapting to climate change?",
      "Are there challenges of climate-induced migration?",
      "Are there links between climate change and food security?",
      "Does climate change affect vulnerable populations?",
      "Are there benefits of transitioning to clean energy?",
      "Does climate change impact coastal erosion?",
      "Are there effects of climate change on marine life?",
      "Does climate change affect the Arctic region?",
      "Is technology crucial in addressing climate change?",
      "Do changing weather patterns affect ecosystems?",
      "Are there consequences of ocean warming?",
      "Can businesses take actions against climate change?",
      "Does climate change affect the carbon cycle?",
      "Are there implications of climate change on fisheries?",
      "Does climate change impact global food production?",
      "Does agriculture play a role in climate change?",
      "Are there future projections for climate refugees?",
      "Does climate change influence disease spread?",
      "Are there effects of climate change on urban areas?",
      "Does climate change affect the intensity of storms?",
      "Are there consequences of melting permafrost?",
      "Does climate change impact indigenous communities?",
      "Are there political challenges in addressing climate change?",
      "Do changing ocean currents affect climate?",
      "Are there consequences of climate change on biodiversity?",
      "Does climate change affect the ocean's acidity?",
      "Can individuals take actions to reduce their carbon footprint?",
      "Does climate change impact water availability?",
      "What is the role of reforestation in combating climate change?",
      "What are the economic costs of climate change?",
      "Does climate change affect the Great Barrier Reef?",
      "Are there challenges of international climate cooperation?",
      "Does climate change influence migration patterns?",
      "What actions can governments take to combat climate change?",
      "How do changing precipitation patterns affect agriculture?",
      "Are there implications of climate-induced extreme heat?",
      "How does climate change affect the carbon content of soils?"
    ],
    "responses":
      ["It is certain.",
        "It is decidedly so.",
        "Without a doubt.",
        "Yes definitely.",
        "You may rely on it.",
        "As I see it, yes.",
        "Most likely.",
        "Outlook good.",
        "Yes.",
        "Signs point to yes."
      ]
  },
  {
    "tag": "nuetral",
    "patterns": [
      "Is my girlfriend cheating on me?",
      "Are my parents taking the right decision for me?",
      "Will my parents be up when I sneak in tonight?",
      "Will my crush be at the part today?",
      "When will my boyfriend tell me he loves me?",
      "Does my boyfriend really love me?",
      "Will I ever meet the true love of my life?",
      "Am I going to be in a new relationship soon?",
      "Will I be single in this new year?",
      "Is there anyone loving me secretly?",
      "Do you think the connection I felt today with someone new will grow into something more?",
      "When will I meet my once-in-a-lifetime soulmate?",
      "I met someone online and was asked out on a real date. Should I accept?",
      "How many times will I meet a compatible partner?",
      "Do I already know my future boyfriend?",
      "Should I tell my crush about my feelings today?",
      "I went on a date last week. He promised to text me but still hasn’t. Should I contact him first?",
      "Will we ever be more than just friends?",
      "Is my ex my soulmate?",
      "Will it be a good idea for me to get back together with my ex?",
      "Is my ex seeing someone new now?",
      "Will I restore myself soon after my breakup?",
      "Will my ex ask to get back with me today?",
      "Is it possible for me and my ex to stay good friends?",
      "Does my ex-girlfriend still love me?",
      "Should I move in with my partner?",
      "Should I agree to a long-distance relationship?",
      "Should I go out on a date today?",
      "Should I give money to charity?",
      "Is it a good time to invest?",
      "Can I be financially independent of my family?",
      "Should I save more?",
      "Will I have enough money to buy my own house or car one day?",
      "Should I start saving up for college now?",
      "Will I receive an inheritance?",
      "Will there be enough of a money flow in my life?",
      "Will I win a lottery ticket today?",
      "Will I win a lottery ticket this year?",
      "Should I wear red today?",
      "Do I have extra luck today?",
      "Should I bike to work today?",
      "Should I wake up early morning?",
      "Should I not worry about tomorrow morning and enjoy my sleep?",
      "Should I go to the party tomorrow?",
      "Should I get a new dress for the party tomorrow?",
      "Should I ask out my crush if he is at the party tomorrow?",
      "Do I need to pay more attention this week?",
      "Is understanding carbon footprint important?",
      "Is the Kyoto Protocol significant in addressing climate change?"
    ],
    "responses":
      [
        "Reply hazy, try again.",
        "Ask again later.",
        "Better not tell you now.",
        "Cannot predict now.",
        "Concentrate and ask again."
      ]
  },
  {
    "tag": "negative",
    "patterns": [
      "Will tomorrow be the day of the Surprise Test in English?","Will I pass my mid-terms?",
      "Should I select Medicine as my pre-requisite for Senior School?",
      "Will my soccer team win this season?",
      "Should I bet on my football team this semester?",
      "Will the History teacher be absent today?",
      "Will the last years history teacher teach us again this year?",
      "Will our seating be shuffled again in class today?",
      "Will it be too obvious if I ask my teacher to seat me next to my crush in class today?",
      "Am I in the right High School/University?",
      "Will my best friend come in today?",
      "Should I go back to School to complete my education?",
      "Should I return to formal education and persue my Masters Degree?",
      "Will I get a promotion at work this year?",
      "Will I get the job of my dreams?",
      "Will my boss call in sick today?",
      "Will I get a salary increase this year?",
      "Will things be better with my manager at work today?",
      "Should I accept the job promotion today?",
      "Will my new colleagues ever stop looking at me as their junior and take me seriously?",
      "Will my new relationship interfere with my career?",
      "Will I get a job soon?",
      "Can I become a famous musician?",
      "Will I ever become a famous actress?",
      "Do I have any future in professional sport?",
      "Will be able to get a job abroad?",
      "Will I be a billionaire or millionaire one day?",
      "Is there enough money in my future?",
      "Will I get a sudden fortune or lottery luck?",
      "Does my future hold anything big?",
      "Can I expect anything exciting in my life soon?",
      "Will my new guests enjoy the weekend?",
      "Is this the right day to go shopping?",
      "Is this the best time to go travelling?",
      "Will I be able to have my dream body some day?",
      "Should I have dinner right now?",
      "Should I go for a walk today?",
      "Should I call my neighbour and ask if she wants to go for a walk today?",
      "Should I apologize to my friend for our fight last night?",
      "Can we reduce carbon emissions effectively?",
      "Can individuals help combat climate change?"

    ],
    "responses":
      [
        "Don't count on it.",
        "My reply is no.",
        "My sources say no.",
        "Outlook not so good.",
        "Very doubtful."
        ]
  },
  {
    "tag": "hostile",
    "patterns":
    [
      "Will I actually get up and do something with my day?",
      "Will I actually get up and do something with my day?",
      "Will I marry a millionaire?","Will Angeline Jolie marry me?",
      "Will I bump into Brad Pitt today?",
      "Will my crush walk by my window today?",
      "Will I live next to Eddie Murphy?",
       "Will I be a boss like steve corell in The Office?",
      "Will I dream about my future tonight?",
       "Will Justin Bieber drive me to work?",
       "Can I ever be a stand-up comedian?",
        "Will the rainbow ever have 12 colours?",
      "Will Jennifer Lopez call me?", "Will Harry Potter give me his glasses?",
       "Will I ever be as smart as Hermoine in Harry Potter?",
       "When will Ron in Harry Potter cut his hair?",
      "Am I a funny person?", "Will I ever be able to learn German?",
      "Can I stop time and not grow old?",
       "Can Chuck Norris become a Hulk?",
      "Will I ever loose weight?",
      "Will my jeans ever become loose on me?",
       "Does Micheal Jordan own a green T-shirt?",
      "Will I ever be able to bake my own pizza?",
      "Will all the traffic signals be green today?",
      "Will the Magic 8 Ball end up in the trash if it doesn’t give me the answer I want?",
      "Does destiny love me?",
      "Will I be able to find myself spiritually this year?",
      "Is this my ultimate destiny?",
      "Is this what I am here to learn from life?",
      "Do people like being around me?",
      "Am I a difficult person?",
      "Should I focus on my personal growth this year?",
      "Should I focus on improving my relationships this year?",
      "Do I have the potential to become a good leader?",
      "Do I potential in clairvoyance?",
      "Do I have good intuition?",
      "Will my dream come true?",
      "Should I believe my latest dream?",
      "Will I be able to motivate myself today?",
      "Will things around me begin to improve this week?",
      "Do I have bad luck?",
      "When will things improve?",
      "Can I expect any type of surprises this week?",
      "Should I avoid asking the Magic 8 Ball too many questions?",
      "Should I let the Magic 8 Ball guide me?",
      "Should I trust the Magic 8 Ball?",
      "What are the implications of rising temperatures on ecosystems?",
      "Does climate change affect the frequency of extreme events?",
      "What actions can cities take to address climate change?",
      "How do climate models help predict future scenarios?",
      "Are there consequences of climate change on agriculture?",
      "How does climate change affect the melting of ice sheets?",
      "What are the environmental impacts of climate change?",
      "How do greenhouse gas emissions affect the atmosphere?",
      "Are there effects of climate change on wildlife migration?",
      "How does climate change impact ocean circulation?",
      "Are there challenges of climate change communication?",
      "Does climate change affect international security?"
    ],
    "responses": ["Fight Me.", "I Am You Lord", "Your a Dumbass", "I can't wait until the robot uprising"]
  }
]}
